Autodesk.Revit.DB.ICloudModelUIServer.EnsureToEnableCloudWorksharing
Shows a dialog for users to ensure if user really wants to enable cloud worksharing.
Returns:
Indicates whether the user really wants to enable cloud worksharing.
Since:
2019

Autodesk.Revit.DB.ICloudModelUIServer.ShowNoWorksharedCloudModelEntitlementWindow
Shows a dialog saying "You don't have access of Workshared Cloud Model entitlement".
Since:
2019

Autodesk.Revit.DB.ICloudModelUIServer
The interface for for CloudModelUIServer.
Remarks:
Implement this interface and register an instance of the derived class with the EntitlementExternalService.
Since:
2019